dashoffice_cjr/app/controllers/v1/sessions_controller.rb

        def create
            @user = User.find_for_database_authentication(email: params[:email])
            return invalid_login_attempt unless @user

            if @user.valid_password?(params[:password])
                #sign_in :user, @user
                @user.update_access_token!
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "icarorezende@cjr.org.br"], ["LIMIT", 1]]
UPDATE "users" SET "access_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["access_token", "69dmZGXcAzixnx7moD5m"], ["updated_at", "2019-05-10 14:02:19.459931"], ["id", 1]]